{
/* Passphrase panel titles */
"MESSAGE_AUTHENTICATION_TITLE" = "메시지 인증";
"MESSAGE_DECRYPTION_PASSPHRASE_TITLE" = "메시지 해독";

/**/
"DECRYPTING" = "암호해독 중입니다...";
"ENCRYPTING" = "암호화  중입니다...";

/* <PGP> submenu title */
"PGP_MENU" = "PGP";
/* <PGP Keys> submenu title */
"PGP_KEYS_MENU" = "PGP 키";

/* <PGP> submenu items */
"DECRYPT_MENU" = "암호해독";
"AUTHENTICATE_MENU" = "인증";
"ENCRYPT_MENU" = "새 메시지의 암호화";
"SIGN_MENU" = "새 메시지에 서명";

/* Description of version prefixed with <Version:> */
"VERSION: %@" = "버전: %@";

/* PGP preferences panel name */
"PGP_PREFERENCES" = "PGP";

/* Alert title and message */
"MSG_DECRYPTION_ALERT_TITLE_NOT_SIGNED" = "메시지 암호해독";
"DECRYPTED_MSG_NOT_SIGNED" = "메시지가 해독되었으나 서명은 없습니다. 따라서 그 진위 여부를 증명할 수 없습니다.";
"MSG_ENCRYPTION_ALERT_TITLE" = "PGP 암호화가 실패했습니다";
"MSG_DECRYPTION_ALERT_TITLE" = "PGP 암호해독에 실패했습니다";
"MSG_SIGNING_ALERT_TITLE" = "PGP 서명에 실패했습니다";
"UNSUPPORTED_ENCRYPTION_FORMAT" = "GPGMail은 이와 같은 종류의 암호화된 메시지를 해독할 수 없습니다.";
"DATA_NOT_AVAILABLE" = "메시지의 본문을 찾을 수 없습니다.";

/* Informational alert title and message */
"AUTHENTICATION_TITLE_OK" = "PGP 인증";

/**/
"AUTHENTICATION_TITLE_FAILED" = "PGP 인증에 실패했습니다";
"TRY_AGAIN" = "재시도";
"CANCEL_DELIVERY" = "취소";
"CANCEL_DECRYPTION" = "취소";

/**/
"AUTHENTICATION_TITLE_UNSIGNED" = "PGP 인증";
"UNSIGNED_PGP_MESSAGE" = "이 메시지는 PGP 서명이 되어 있지 않습니다.";

/* Toolbar item titles */
"DECRYPT_ITEM" = "암호해독";
"AUTHENTICATE_ITEM" = "인증";
"MAKE_ENCRYPTED_ITEM" = "암호화";
"MAKE_CLEAR_ITEM" = "해제";
"MAKE_UNSIGNED_ITEM" = "서명하지 않음";
"MAKE_SIGNED_ITEM" = "서명 첨부";
"ENCRYPTED_ITEM" = "암호화 되었음";
"CLEAR_ITEM" = "해제";
"SIGNED_ITEM" = "서명있음";
"UNSIGNED_ITEM" = "서명없음";

/* Toolbar item tooltips  */
"DECRYPT_ITEM_TOOLTIP" = "PGP-암호화 된 메시지를 해독합니다";
"AUTHENTICATE_ITEM_TOOLTIP" = "PGP-서명된 메시지를 인증합니다";
"MAKE_CLEAR_ITEM_TOOLTIP" = "암호해제된 메시지를 보내려면 클릭 하세요";
"MAKE_ENCRYPTED_ITEM_TOOLTIP" = "PGP 암호화를 사용하려면 클릭하세요";
"MAKE_UNSIGNED_ITEM_TOOLTIP" = "PGP 인증 없이 메시지를 보내려면 클릭 하세요";
"MAKE_SIGNED_ITEM_TOOLTIP" = "PGP 인증을 사용하려면 클릭 하세요";
"ENCRYPTED_ITEM_TOOLTIP" = "메시지가 암호화 됩니다; 암호화를 해제 하려면 클릭하세요";
"CLEAR_ITEM_TOOLTIP" = "메시지를 암호화 하지 않습니다; PGP 암호화를 하려면 클릭하세요";
"SIGNED_ITEM_TOOLTIP" = "메시지에 PGP 서명을 합니다; PGP 인증 없이 메시지를 보내려면 클릭하세요";
"UNSIGNED_ITEM_TOOLTIP" = "메시지에 PGP 서명을 하지 않습니다; PGP 인증을 사용하려면 클릭하세요";

/* Signature information */
"Bad policy!"  = "잘못된 policy! "; // Followed by a list of policy URLs
"Policy: " = "Policy: "; // Followed by a list of policy URLs
"Signed on %@" = "%@에 서명되었음"; // Param is a date, whose format is set by SIGNATURE_CREATION_DATE_FORMAT
"SIGNATURE_CREATION_DATE_FORMAT" = "%c"; // See NSCalendarDate documentation for format
"No signature creation date available" = "서명 생성 날짜가 없습니다";
"Key fingerprint: %@" = "키 지문: %@";
"Key ID: 0x%@" = "키 아이디: 0x%@";
"No key fingerprint/ID available" = "지문/아이디가 없습니다";
"Validity: %@" = "신뢰 정도: %@"; // Param is the validity status string
"Signature expires on %@" = "%@에 서명이 무효가 됩니다"; // Param is a date, whose format is set by SIGNATURE_EXPIRATION_DATE_FORMAT
"SIGNATURE_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Key expired on %@" = "%@에 키가 무효가 됩니다"; // Param is a date, whose format is set by KEY_EXPIRATION_DATE_FORMAT
"KEY_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Signed by %@." = "%@에 의해 서명 되었음"; // Param is a userID
"Signature from %@ is bad!" = "%@의 서명이 잘못 되었습니다!"; // Param is a userID
"Signature is bad!" = "잘못된 서명입니다!";
"Signature status error." = "서명 상태 에러가 발생했습니다";
"MISSING KEY %@." = "키 %@를 찾을 수 없습니다."; // Param is a key ID in hexadecimal
"Signature summary 0x%04x - Signature status %u." = "알 수 없는 에러: 서명 요약  0x%04x - 서명 상태 %u."; // Generic error message; first param is a hex status flag value, second is a decimal status value
"EXCEPTION: %@" = "내부 에러: %@"; // Generic error message; param is a string (exception reason, maybe not localized)
"AUTHENTICATING" = "VPGP 서명을 검증하고 있습니다...";
"UNTRUSTED RECIPIENTS" = "키 중 최소한 하나를 신뢰할 수 없습니다";

/* Title */
/* Error messages */
"GPGMAIL_CANNOT_WORK" = "보조 어플리케이션이 실행되지 않았기 때문에 GPGMail이 작동할 수 없습니다. Mail을 다시 시작해 보시고, 그래도 에러가 나면, gpgmail-devel@lists.gpgmail.org로 연락 주세요";
"GPGMAIL_CANNOT_WORK_HAS_GPG_%@_VERSION_%@_NEEDS_%@" = "GPGMail이 작동할 수 없습니다. GnuPG (%@) 버전 %@을 발견했지만, 최소한 버전 %@ 이상이어야 합니다. 메일을 종료하고, 적절한 버전의 GnuPG(가령, MacGPG의 배포판, http://macgpg.sourceforge.net/)를 설치한 후 메일을 다시 시작하세요."; // First arg is path to gpg, second and third are version strings
"GPGMAIL_CANNOT_WORK_MISSING_GPG_%@_VERSION_%@" = "GPGMail이 작동할 수 없습니다. 최소 요구 버전 %@의 GnuPG (%@)를 찾지 못했습니다. 메일을 종료하고, 적절한 GnuPG 버전(예를 들면  MacGPG 그룹의 배포판, http://macgpg.sourceforge.net/)을 설치하고, 메일을 다시 시작 하세요."; // First arg is path to gpg, second is version string
"INVALID_GPGMAIL_VERSION" = "사용하고 있는 GPGMail 버전은 지금 사용하고 있는 메일의 버전과 호환되지 않습니다."; /* Title of alert sheet */
"NEEDS_COMPATIBLE_BUNDLE_VERSION" = "현재 사용하고 있는 오에스에 맞는 버전의 GPGMail을 사용해야 합니다. http://www.gpgmail.org/ 에서 다운로드하여 설치 하세요.";

/* Validity */
"VALIDITY: " = "신뢰 정도: ";
"Validity=0" = "알려 지지 않음";
"Validity=1" = "정의 되지 않음";
"Validity=2" = "절대 신뢰할 수 없음";
"Validity=3" = "약간 신뢰함";
"Validity=4" = "신뢰함";
"Validity=5" = "절대적으로 신뢰함";

/* Generic MacGPGME error messages */
"GPGErrorCode=1" = "일반 오류";
"GPGErrorCode=8" = "잘못된 서명";
"GPGErrorCode=9" = "공개키 없음";
"GPGErrorCode=10" = "체크섬 에러";
"GPGErrorCode=11" = "잘못된 암호문";
"GPGErrorCode=15" = "잘못된 아머";
"GPGErrorCode=17" = "비밀키 없음";
"GPGErrorCode=31" = "유효하지 않은 암호문";
"GPGErrorCode=40" = "키 서버 에러";
"GPGErrorCode=53" = "사용불가능한 공개키";
"GPGErrorCode=54" = "사용불가능한 비밀키";
"GPGErrorCode=55" = "유효하지 않은 값";
"GPGErrorCode=58" = "데이터 없음";
"GPGErrorCode=69" = "아직 구현되지 않았음";
"GPGErrorCode=84" = "지원되지 않는 알고리즘";
"GPGErrorCode=94" = "인증이 철회된 키";
"GPGErrorCode=99" = "취소되었음";
"GPGErrorCode=107" = "이름이 모호함";
"GPGErrorCode=116" = "해당하는 policy 없음";
"GPGErrorCode=125" = "잘못된 키 사용법";
"GPGErrorCode=150" = "유효하지 못한 엔진";
"GPGErrorCode=151" = "신뢰할 수 없는 공개키";
"GPGErrorCode=152" = "암호해독 실패";
"GPGErrorCode=153" = "유효기간이 지난 키";
"GPGErrorCode=154" = "유효기간이 지난 서명";
"GPGErrorCode=16383" = "EOF";

/* Signature attachment filename (suffixed automatically by .sig) */
"PGP_SIGNATURE_FILENAME" = "PGP";

/* Signature attachment content-description */
"This is a digitally signed message part" = "여기에는 디지털 서명이 되어 있습니다";

/* Version MIME part content description header */
"CONTENT_DESCRIPTION_HEADER" = "PGP/MIME version identification";

/* Encrypted attachment filename (suffixed automatically by .asc) */
"PGP_ENCRYPTED_FILENAME" = "PGP";

/* Encrypted attachment content-description */
"This is an encrypted message part" = "여기에는 메시지가 암호화 되어 있습니다";

/* Multiple-part description */
"MULTIPART_ENCRYPTED_DESCRIPTION" = "This is an OpenPGP/MIME encrypted message (RFC 2440 and 3156)";
"MULTIPART_SIGNED_DESCRIPTION" = "This is an OpenPGP/MIME signed message (RFC 2440 and 3156)";

/* Tooltip for banner icons */
"SIGNATURE_IS_GOOD" = "서명이 손상되지 않았습니다; 메시지가 원본 그대로입니다";
"SIGNATURE_IS_NOT_GOOD" = "서명이 좋지 못합니다; 메세지가 원본과 다릅니다";

/* PGP Key Download panel */
"PGP_SEARCH_KEYS_MENUITEM" = "PGP 키 검색";
"SEARCH" = "검색";
"CANCEL_SEARCH" = "취소";
"SEARCHING" = "검색 중...";
"NO_MATCHING_KEYS" = "맞는 키 없음";
"FOUND_%d_KEYS" = "%d 개의 키를 발견했습니다.";
"DOWNLOAD" = "다운로드";
"DOWNLOADING" = "다운로드 중...";
"DOWNLOADED" = "다운로드하여 키를 임포트 했습니다";
"SEARCH_KEYS_ON_SERVER" = "키 서버에서 PGP 키 검색";
"DOWNLOAD_KEYS_FROM_SERVER" = "키 서버로부터 PGP 키 다운로드 받기";
"SEARCH_ERROR" = "검색 중 오류가 발생했습니다";
"DOWNLOAD_ERROR" = "다운로드 중 오류가 발생했습니다";
" (%u bits)" = " (%u bits)";
", created on %@" = ", %@에 생성되었음";
", expires on %@" = ", %@에 만료됨";
", expired on %@" = ", expired on %@";
"REVOKED_KEY - " = "철회되었음 - "; // Prefixes found key description, when necessary; followed by keyID, userID, etc.

/* Unmatched PGP keys for receipts - sheet */
"MISSING_KEYS: DOWNLOAD" = "일부 주소에 해당하는 PGP 키가 없습니다. 키를 검색할까요?"; // Title
"UNMATCHED_ADDRESSES: %@" = "다음 이메일 주소에 해당하는 PGP 키가 없습니다:\n%@"; // Message
"SEARCH_MATCHING_KEYS" = "검색"; // Default button
"SEND_IN_CLEAR" = "Send in Clear"; // Other button

"INVALID_HASH_%@" = "해쉬 알고리즘 '%@'는 RFC3156에 허용되지 않습니다";
"GPGMAIL_VS_PGPMAIL" = "PGPmail이 설치되어 있으면 GPGMail은 작동하지 않습니다";
"GPGMAIL_%@_VS_PGPMAIL_%@" = "이 두 가지 번들은 다른 엔진을 사용하지만 같은 기능을 수행합니다. 둘 중 하나만이 설치될 수 있습니다. '%@', 또는 '%@'을 제거해야 합니다";
"QUIT" = "종료";
"CONTINUE_ANYWAY" = "계속 시도"; // Button title in alert panel

/* Composer accessory view header, under To:, CC:, Subject: */
"PGP:" = "PGP:";

/* Key description in popups; prefixes key (actually, primary userID), when necessary; followed by keyID, userID, etc.*/
"REVOKED_KEY:" = "Revoked:";
"EXPIRED_KEY:" = "Expired:";
"DISABLED_KEY:" = "Disabled:";
"INVALID_KEY:" = "Invalid:";

/* UserID description in popups; prefixes userID, when necessary; followed by name, email, etc.*/
"REVOKED_USER_ID:" = "Revoked:";
"INVALID_USER_ID:" = "Invalid:";

/* GPGMail exception reasons */
"NO_VALID_PUBLIC_KEY" = "No valid public key has been found. They are all either expired, disabled or revoked."; // Could be displayed after encryption
"NO_VALID_PRIVATE_KEY" = "No valid personal key has been found. Either none was selected, or selected key is revoked, disabled or has expired."; // Could be displayed after encryption

/* Alert when user has no PGP key */
"NO PGP PRIVATE KEY - TITLE" = "You don't have any PGP key. You can't use GPGMail to encrypt or sign messages.";
"NO PGP PRIVATE KEY - MESSAGE" = "If you want to be able to encrypt or sign messages with PGP, you need a personal PGP key. To create a PGP key, download and install MacGPG's GPG Keychain Access from http://macgpg.sourceforge.net/";

/* Conflict resolution panel*/
"<ME>" = "Me";
"<YES>" = "Yes";
"<NO>" = "No";
"<ALWAYS>" = "Always";
"<NEVER>" = "Never";
"<ACCEPTS>" = "Accepts";

/* Additional info describing key */
"DISABLED_KEY_QUALIFIER" = "disabled";
"INVALID_KEY_QUALIFIER" = "invalid";
"REVOKED_KEY_QUALIFIER" = "revoked";
"EXPIRED_KEY_QUALIFIER" = "expired";
"CANNOT_ENCRYPT_KEY_QUALIFIER" = "cannot encrypt";
"CANNOT_SIGN_KEY_QUALIFIER" = "cannot sign";

/* Additional info describing userID */
"INVALID_USER_ID_QUALIFIER" = "invalid";
"REVOKED_USER_ID_QUALIFIER" = "revoked";

"COPY_MSG_URL_MENUITEM" = "Copy Message URL";
}
